#include"AnimData.h"

/*static TexAnim Enemy3Step[] = {
	{ 23,5 },
	{ 24,5 },
	{ 25,5 },
	{ 26,5 },
	{ 27,5 },
	{ 28,5 },
	{ 29,5 },
	{ 30,5 },
	{ 31,5 },
	
};
static TexAnim Enemy3Attack01[] = {
	//弓

	{ 242,5 },
	{ 243,5 },
	{ 244,10 },
	{ 245,11 },
	{ 246,12 },
	{ 247,13 },
	{ 248,14 },
	{ 249,15 },
	{ 250,10 },
	{ 251,9},
	{ 252,7 },
	{ 253,6 },
	{ 254,5 },
	{ 255,5 },
	{ 256,5 },
	
	

};
static TexAnim Enemy3Attack02[] = {
	//近接攻撃
	
{220,10},
{ 221,10 },
{ 222,10 },
{ 223,8 },
{ 224,8 },
{ 225,8 },
{ 226,8 },
{ 227,8 },
{ 228,8 },
{ 229,8 },



};

static TexAnim Enemy3Attack03[] = {
	//俺はハンターだ！！..........
	{ 288,10},
	{ 289,10},
	{ 290,10},
	{ 291,10},
	{ 292,20},
	{ 293,20},
	{ 294,20},
	{ 295,10 },
	{ 296,10 },
	{ 297,9 },
	{ 298,9 },
	{ 299,8 },
	{ 300,7 },
	{ 301,6 },
	{ 302,6 },

};
TexAnimData enemy3_anim_data[] = {
	ANIMDATA(Enemy3Step),
	ANIMDATA(Enemy3Attack01),
	ANIMDATA(Enemy3Attack02),
	ANIMDATA(Enemy3Attack03),
	
};*/
