#include"AnimData.h"

static TexAnim Enemy3Step[] = {
	{ 23,5 },
	{ 24,5 },
	{ 25,5 },
	{ 26,5 },
	{ 27,5 },
	{ 28,5 },
	{ 29,5 },
	{ 30,5 },
	{ 31,5 },
	
};
static TexAnim Enemy3Attack01[] = {
	{ 48,2 },
	{ 49,2 },
	{ 50,2 },
	{ 51,2 },
	{ 52,2 },
};
static TexAnim Enemy3Attack02[] = {
	//弓発射
	{ 263,10 },
	{264,10},
{ 265,10 },
{ 266,10 },
{ 267,10 },
{ 268,10 },
{ 269,10 },
{ 270,10 },
{ 271,10 },
{ 272,10 },
{ 273,10 },
{ 274,10 },
{ 275,10 },
{ 276,10 },
{ 277,10 },
{ 278,10 },
{ 279,10 },
{ 280,10 },
{281,10},
};

static TexAnim Enemy3Attack03[] = {
	//俺はハンターだ！！..........
	{ 288,10},
	{ 289,10},
	{ 290,10},
	{ 291,10},
	{ 292,20},
	{ 293,20},
	{ 294,20},
	{ 295,10 },
	{ 296,10 },
	{ 297,9 },
	{ 298,9 },
	{ 299,8 },
	{ 300,7 },
	{ 301,6 },
	{ 302,6 },

};
TexAnimData enemy3_anim_data[] = {
	ANIMDATA(Enemy3Step),
	ANIMDATA(Enemy3Attack01),
	ANIMDATA(Enemy3Attack02),
	ANIMDATA(Enemy3Attack03),
	
};
